example01_basic_timed_system/output/symbex_graph.puml

@startuml symbex_graph

' // scale 600 width

hide empty description

skinparam linetype polyline
' skinparam linetype ortho
' left to right direction

skinparam backgroundColor White
skinparam backgroundColor White
skinparam noteBorderColor White
skinparam shadowing false
skinparam notefontsize 16
skinparam notefontname Verdana
'skinparam notefontname Consolas
'skinparam noteShadowing false

skinparam state {
	StartColor Green
	EndColor Red

	'Attribut pour les transitions
	ArrowColor Black
	ArrowColor<< Else >> Orange

	'Attribut par défaut pour les états
	BorderColor Gray
	BackgroundColor Wheat

	'Attribut pour les noeuds/feuilles du graphes SymBex
	BackgroundColor<< DefaultNode >> LightBlue

	BackgroundColor<< RedondancyTargetSource >> Green
	BackgroundColor<< RedondancyTargetNode >> GreenYellow

	BackgroundColor<< PassedNode >> GreenYellow
	BackgroundColor<< FailedNode >> Red
	BackgroundColor<< InconclusiveNode >> Orange
	BackgroundColor<< AbortedNode >> Orange
	BackgroundColor<< WarningNode >> Orange
	BackgroundColor<< ErrorNode >> Red
	BackgroundColor<< AlertNode >> Red
	BackgroundColor<< ExitNode >> Red

	'Attribut pour les paths du graphes SymBex
	BackgroundColor<< PassedPath >> LawnGreen
	BackgroundColor<< FailedPath >> Red
	BackgroundColor<< InconclusiveNodePath >> Orange
	BackgroundColor<< AbortedPath >> Red

	FontColor Black
	FontName Times
	FontSize 14
}



state "EC 0" as EC0 << DefaultNode >>

EC0: < ev:1 , h:0 , w:1 > 
EC0: Example01_Basic_Timed_System_S:q0
note left of EC0
$time = 0
	$delay = 0
	_clock_index_ = 0
	cl = 0
	
end note

EC0 -down-> EC1

state "EC 4" as EC4 << DefaultNode >>

EC4: < ev:1 , h:0 , w:1 > 
EC4: Example01_Basic_Timed_System_S:q0
note left of EC4
$time = 0
	$delay = 0
	_clock_index_ = 0
	cl = 0
	
end note

EC4 -down-> EC5

state "EC 8" as EC8 << DefaultNode >>

EC8: < ev:1 , h:0 , w:1 > 
EC8: Example01_Basic_Timed_System_S:q0
note left of EC8
$time = 0
	$delay = 0
	_clock_index_ = 0
	cl = 0
	
end note

EC8 -down-> EC9

state "EC 12" as EC12 << DefaultNode >>

EC12: < ev:1 , h:0 , w:1 > 
EC12: Example01_Basic_Timed_System_S:q0
note left of EC12
$time = 0
	$delay = 0
	_clock_index_ = 0
	cl = 0
	
end note

EC12 -down-> EC13

state "EC 1" as EC1 << PassedPath >>

EC1: < ev:2 , h:1 , w:1 > 
EC1: Example01_Basic_Timed_System_S:q0

EC1 -down-> EC2

EC1 -down-> EC16

state "EC 5" as EC5 << PassedPath >>

EC5: < ev:2 , h:1 , w:1 > 
EC5: Example01_Basic_Timed_System_S:q0

EC5 -down-> EC6

state "EC 9" as EC9 << PassedPath >>

EC9: < ev:2 , h:1 , w:1 > 
EC9: Example01_Basic_Timed_System_S:q0

EC9 -down-> EC10

state "EC 13" as EC13 << PassedPath >>

EC13: < ev:2 , h:1 , w:1 > 
EC13: Example01_Basic_Timed_System_S:q0

EC13 -down-> EC14

state "EC 2" as EC2 << PassedPath >>

EC2: < ev:3 , h:2 , w:1 > 
EC2: Example01_Basic_Timed_System_S:q1
note left of EC2
$time = $delay_1
	$delay = $delay_1
	
end note
EC2: ----
EC2: tpid#1->q0.tr1

EC2 -down-> EC3

EC2 -down-> EC17

state "EC 16" as EC16 << DefaultNode >>

EC16: < ev:0 , h:2 , w:1 > 
EC16: Example01_Basic_Timed_System_S:q0
note left of EC16
$time = $delay_1
	$delay = $delay_1
	
end note
EC16: ----
EC16: QUIESCENCE

state "EC 6" as EC6 << PassedPath >>

EC6: < ev:3 , h:2 , w:1 > 
EC6: Example01_Basic_Timed_System_S:q1
note left of EC6
$time = $delay_1
	$delay = $delay_1
	
end note
EC6: ----
EC6: tpid#1->q0.tr1

EC6 -down-> EC7

state "EC 10" as EC10 << PassedPath >>

EC10: < ev:3 , h:2 , w:1 > 
EC10: Example01_Basic_Timed_System_S:q1
note left of EC10
$time = $delay_1
	$delay = $delay_1
	
end note
EC10: ----
EC10: tpid#1->q0.tr1

EC10 -down-> EC11

state "EC 14" as EC14 << PassedPath >>

EC14: < ev:3 , h:2 , w:1 > 
EC14: Example01_Basic_Timed_System_S:q1
note left of EC14
$time = $delay_1
	$delay = $delay_1
	
end note
EC14: ----
EC14: tpid#1->q0.tr1

EC14 -down-> EC15

state "EC 3" as EC3 << PassedPath >>

EC3: < ev:0 , h:3 , w:1 > 
EC3: Example01_Basic_Timed_System_S:q0
note left of EC3
PC: ($delay_2 <= 5)
	$time = ($delay_1 + $delay_2)
	$delay = $delay_2
	cl = $delay_2
	
end note
EC3: ----
EC3: tpid#2->q1.tr2

state "EC 17" as EC17 << DefaultNode >>

EC17: < ev:0 , h:3 , w:1 > 
EC17: Example01_Basic_Timed_System_S:q1
note left of EC17
PC: exists< # : urational >(($delay_2 < #) && (# <= 5))
	$time = ($delay_1 + $delay_2)
	$delay = $delay_2
	
end note
EC17: ----
EC17: QUIESCENCE

state "EC 7" as EC7 << PassedPath >>

EC7: < ev:0 , h:3 , w:1 > 
EC7: Example01_Basic_Timed_System_S:q0
note left of EC7
PC: ($delay_2 <= 5)
	$time = ($delay_1 + $delay_2)
	$delay = $delay_2
	cl = $delay_2
	
end note
EC7: ----
EC7: tpid#2->q1.tr2

state "EC 11" as EC11 << PassedPath >>

EC11: < ev:0 , h:3 , w:1 > 
EC11: Example01_Basic_Timed_System_S:q0
note left of EC11
PC: ($delay_2 <= 5)
	$time = ($delay_1 + $delay_2)
	$delay = $delay_2
	cl = $delay_2
	
end note
EC11: ----
EC11: tpid#2->q1.tr2

state "EC 15" as EC15 << PassedPath >>

EC15: < ev:0 , h:3 , w:1 > 
EC15: Example01_Basic_Timed_System_S:q0
note left of EC15
PC: ($delay_2 <= 5)
	$time = ($delay_1 + $delay_2)
	$delay = $delay_2
	cl = $delay_2
	
end note
EC15: ----
EC15: tpid#2->q1.tr2
@enduml
